牌('萬子', X) :- 1 =< X, X =< 9.
牌('筒子', X) :- 1 =< X, X =< 9.
牌('索子', X) :- 1 =< X, X =< 9.
牌('字牌', '東').
牌('字牌', '南').
牌('字牌', '西').
牌('字牌', '北').
牌('字牌', '白').
牌('字牌', '發').
牌('字牌', '中').

萬子(牌('萬子', _)).
萬子(牌('筒子', _)).
萬子(牌('索子', _)).

数牌(牌('萬子', _)).
数牌(牌('筒子', _)).
数牌(牌('索子', _)).

刻子(X, X, X).
順子(牌('萬子', N1), 牌('萬子', N2), 牌('萬子', N3)) :-
    N2 is N1 + 1,
    N3 is N2 + 1,
    1 =< N1, N3 =< 9.

面子(X, Y, Z) :-
    刻子(X, Y, Z) ;
    順子(X, Y, Z).

雀頭(X, X).

和了(_手牌) :-
    雀頭を選択(_, _手牌, _残り手牌1),
    面子を選択(_, _残り手牌1, _残り手牌2),
    面子を選択(_, _残り手牌2, _残り手牌3),
    面子を選択(_, _残り手牌3, _残り手牌4).
    面子を選択(_, _残り手牌4, []).

雀頭を選択([X, X], _手牌, _残り手牌) :-
    select(X, _手牌, _残り手牌1),
    select(X, _残り手牌1, _残り手牌).

面子を選択([X, Y, Z], _手牌, _残り手牌) :-
    select(X1, _手牌, _残り手牌1),
    select(Y1, _残り手牌1, _残り手牌2),
    select(Z1, _残り手牌2, _残り手牌),
    msort([X1, Y1, Z1], [X, Y, Z]), % ソートして順番を固定
    面子(X, Y, Z).

手牌1([牌('萬子', 1),牌('萬子', 1),牌('萬子', 1),
        牌('筒子', 2),牌('筒子', 3),牌('筒子', 4),
        牌('索子', 5),牌('索子', 6),牌('索子', 7),
        牌('字牌', '東'),牌('字牌', '東'), 牌('字牌', '東'),
        牌('字牌', '白'),牌('字牌', '白')]).